jsnyder/FreakUSB/hw/sim3u1xx/si32Hal/SI32_Modules/SI32_I2C_A_Registers.h
//------------------------------------------------------------------------------
// Copyright (c) 2012 by Silicon Laboratories. 
// All rights reserved. This program and the accompanying materials
// are made available under the terms of the Silicon Laboratories End User 
// License Agreement which accompanies this distribution, and is available at
// http://developer.silabs.com/legal/version/v10/License_Agreement_v10.htm
// Original content and implementation provided by Silicon Laboratories.
//------------------------------------------------------------------------------
//
// Script: 0.59
// Version: 1

#ifndef __SI32_I2C_A_REGISTERS_H__
#define __SI32_I2C_A_REGISTERS_H__

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

struct SI32_I2C_A_CONTROL_Struct
{
   union
   {
      struct
      {
         // Busy Flag
         volatile uint32_t BUSYF: 1;
         // Acknowledge
         volatile uint32_t ACK: 1;
         // Arbitration Lost Flag
         volatile uint32_t ARBLF: 1;
         // Acknowledge Request Flag
         volatile uint32_t ACKRQF: 1;
         // Stop
         volatile uint32_t STO: 1;
         // Start
         volatile uint32_t STA: 1;
         // Transmit Mode Flag
         volatile uint32_t TXMDF: 1;
         // Master/Slave Mode Flag
         volatile uint32_t MSMDF: 1;
         // Stop Interrupt Flag
         volatile uint32_t STOI: 1;
         // Acknowledge Interrupt Flag
         volatile uint32_t ACKI: 1;
         // Receive Done Interrupt Flag
         volatile uint32_t RXI: 1;
         // Transmit Done Interrupt Flag
         volatile uint32_t TXI: 1;
         // Start Interrupt Flag
         volatile uint32_t STAI: 1;
         // Arbitration Lost Interrupt Flag
         volatile uint32_t ARBLI: 1;
         // I2C Timer Byte 0 Interrupt Flag
         volatile uint32_t T0I: 1;
         // I2C Timer Byte 1 Interrupt Flag
         volatile uint32_t T1I: 1;
         // I2C Timer Byte 2 Interrupt Flag
         volatile uint32_t T2I: 1;
         // I2C Timer Byte 3 Interrupt Flag
         volatile uint32_t T3I: 1;
         // Receive Arm
         volatile uint32_t RXARM: 1;
         // Transmit Arm
         volatile uint32_t TXARM: 1;
         // Slave Address Type Flag
         volatile uint32_t SLVAF: 1;
         // Auto Transmit or Receive Enable
         volatile uint32_t ATXRXEN: 1;
         // Filter Mode
         volatile uint32_t FMD: 1;
         // I2C Debug Mode
         volatile uint32_t DBGMD: 1;
         // Slave Mode Inhibit
         volatile uint32_t SMINH: 1;
         // Auto Acknowledge Enable
         volatile uint32_t HACKEN: 1;
                  uint32_t reserved0: 1;
         // Last Byte Acknowledge Enable
         volatile uint32_t LBACKEN: 1;
                  uint32_t reserved1: 1;
         // General Call Address Enable
         volatile uint32_t GCEN: 1;
         // Module Soft Reset
         volatile uint32_t RESET: 1;
         // I2C Enable
         volatile uint32_t I2CEN: 1;
      };
      volatile uint32_t U32;
   };
};

#define SI32_I2C_A_CONTROL_BUSYF_MASK  0x00000001
#define SI32_I2C_A_CONTROL_BUSYF_SHIFT  0
// A transaction is not currently taking place.
#define SI32_I2C_A_CONTROL_BUSYF_NOT_SET_VALUE  0
#define SI32_I2C_A_CONTROL_BUSYF_NOT_SET_U32 \
   (SI32_I2C_A_CONTROL_BUSYF_NOT_SET_VALUE << SI32_I2C_A_CONTROL_BUSYF_SHIFT)
// A transaction is currently taking place.
#define SI32_I2C_A_CONTROL_BUSYF_SET_VALUE  1
#define SI32_I2C_A_CONTROL_BUSYF_SET_U32 \
   (SI32_I2C_A_CONTROL_BUSYF_SET_VALUE << SI32_I2C_A_CONTROL_BUSYF_SHIFT)

#define SI32_I2C_A_CONTROL_ACK_MASK  0x00000002
#define SI32_I2C_A_CONTROL_ACK_SHIFT  1
// Read: ACK has not been received. Write: Do not send an ACK.
#define SI32_I2C_A_CONTROL_ACK_NOT_SET_VALUE  0
#define SI32_I2C_A_CONTROL_ACK_NOT_SET_U32 \
   (SI32_I2C_A_CONTROL_ACK_NOT_SET_VALUE << SI32_I2C_A_CONTROL_ACK_SHIFT)
// Read: ACK received. Write: Send an ACK.
#define SI32_I2C_A_CONTROL_ACK_SET_VALUE  1
#define SI32_I2C_A_CONTROL_ACK_SET_U32 \
   (SI32_I2C_A_CONTROL_ACK_SET_VALUE << SI32_I2C_A_CONTROL_ACK_SHIFT)

#define SI32_I2C_A_CONTROL_ARBLF_MASK  0x00000004
#define SI32_I2C_A_CONTROL_ARBLF_SHIFT  2
// Arbitration lost error has not occurred.
#define SI32_I2C_A_CONTROL_ARBLF_NOT_SET_VALUE  0
#define SI32_I2C_A_CONTROL_ARBLF_NOT_SET_U32 \
   (SI32_I2C_A_CONTROL_ARBLF_NOT_SET_VALUE << SI32_I2C_A_CONTROL_ARBLF_SHIFT)
// Arbitration lost error occurred.
#define SI32_I2C_A_CONTROL_ARBLF_SET_VALUE  1
#define SI32_I2C_A_CONTROL_ARBLF_SET_U32 \
   (SI32_I2C_A_CONTROL_ARBLF_SET_VALUE << SI32_I2C_A_CONTROL_ARBLF_SHIFT)

#define SI32_I2C_A_CONTROL_ACKRQF_MASK  0x00000008
#define SI32_I2C_A_CONTROL_ACKRQF_SHIFT  3
// ACK has not been requested.
#define SI32_I2C_A_CONTROL_ACKRQF_NOT_SET_VALUE  0
#define SI32_I2C_A_CONTROL_ACKRQF_NOT_SET_U32 \
   (SI32_I2C_A_CONTROL_ACKRQF_NOT_SET_VALUE << SI32_I2C_A_CONTROL_ACKRQF_SHIFT)
// ACK requested.
#define SI32_I2C_A_CONTROL_ACKRQF_SET_VALUE  1
#define SI32_I2C_A_CONTROL_ACKRQF_SET_U32 \
   (SI32_I2C_A_CONTROL_ACKRQF_SET_VALUE << SI32_I2C_A_CONTROL_ACKRQF_SHIFT)

#define SI32_I2C_A_CONTROL_STO_MASK  0x00000010
#define SI32_I2C_A_CONTROL_STO_SHIFT  4
// Read: A stop is not pending and a stop / repeat start has not been detected.
// Write: Clear the STO bit.
#define SI32_I2C_A_CONTROL_STO_NOT_SET_VALUE  0
#define SI32_I2C_A_CONTROL_STO_NOT_SET_U32 \
   (SI32_I2C_A_CONTROL_STO_NOT_SET_VALUE << SI32_I2C_A_CONTROL_STO_SHIFT)
// Read: Stop or stop / repeat start detected. This bit must be cleared by
// firmware. Write: Generate a stop.
#define SI32_I2C_A_CONTROL_STO_SET_VALUE  1
#define SI32_I2C_A_CONTROL_STO_SET_U32 \
   (SI32_I2C_A_CONTROL_STO_SET_VALUE << SI32_I2C_A_CONTROL_STO_SHIFT)

#define SI32_I2C_A_CONTROL_STA_MASK  0x00000020
#define SI32_I2C_A_CONTROL_STA_SHIFT  5
// Read: A start is not pending and a repeat start has not been detected. Write:
// Clear the STA bit.
#define SI32_I2C_A_CONTROL_STA_NOT_SET_VALUE  0
#define SI32_I2C_A_CONTROL_STA_NOT_SET_U32 \
   (SI32_I2C_A_CONTROL_STA_NOT_SET_VALUE << SI32_I2C_A_CONTROL_STA_SHIFT)
// Read: Start or repeat start detected. This bit must be cleared by firmware.
// Write: Generate a start or repeat start.
#define SI32_I2C_A_CONTROL_STA_SET_VALUE  1
#define SI32_I2C_A_CONTROL_STA_SET_U32 \
   (SI32_I2C_A_CONTROL_STA_SET_VALUE << SI32_I2C_A_CONTROL_STA_SHIFT)

