jsnyder/FreakUSB/hw/sim3u1xx/si32Hal/SI32_Modules/SI32_I2C_A_Registers.h
#define SI32_I2C_A_CONTROL_TXMDF_MASK  0x00000040
#define SI32_I2C_A_CONTROL_TXMDF_SHIFT  6
// Module is in receiver mode.
#define SI32_I2C_A_CONTROL_TXMDF_RECEIVE_VALUE  0
#define SI32_I2C_A_CONTROL_TXMDF_RECEIVE_U32 \
   (SI32_I2C_A_CONTROL_TXMDF_RECEIVE_VALUE << SI32_I2C_A_CONTROL_TXMDF_SHIFT)
// Module is in transmitter mode.
#define SI32_I2C_A_CONTROL_TXMDF_TRANSMIT_VALUE  1
#define SI32_I2C_A_CONTROL_TXMDF_TRANSMIT_U32 \
   (SI32_I2C_A_CONTROL_TXMDF_TRANSMIT_VALUE << SI32_I2C_A_CONTROL_TXMDF_SHIFT)

#define SI32_I2C_A_CONTROL_MSMDF_MASK  0x00000080
#define SI32_I2C_A_CONTROL_MSMDF_SHIFT  7
// Module is operating in Slave mode.
#define SI32_I2C_A_CONTROL_MSMDF_SLAVE_VALUE  0
#define SI32_I2C_A_CONTROL_MSMDF_SLAVE_U32 \
   (SI32_I2C_A_CONTROL_MSMDF_SLAVE_VALUE << SI32_I2C_A_CONTROL_MSMDF_SHIFT)
// Module is operating in Master mode.
#define SI32_I2C_A_CONTROL_MSMDF_MASTER_VALUE  1
#define SI32_I2C_A_CONTROL_MSMDF_MASTER_U32 \
   (SI32_I2C_A_CONTROL_MSMDF_MASTER_VALUE << SI32_I2C_A_CONTROL_MSMDF_SHIFT)

#define SI32_I2C_A_CONTROL_STOI_MASK  0x00000100
#define SI32_I2C_A_CONTROL_STOI_SHIFT  8
// Read: A stop interrupt has not occurred. Write: Clear the stop interrupt flag
// (STOI).
#define SI32_I2C_A_CONTROL_STOI_NOT_SET_VALUE  0
#define SI32_I2C_A_CONTROL_STOI_NOT_SET_U32 \
   (SI32_I2C_A_CONTROL_STOI_NOT_SET_VALUE << SI32_I2C_A_CONTROL_STOI_SHIFT)
// Read: Stop interrupt detected. In Slave mode, a stop has been detected on the
// bus.  In Master mode, a stop has been generated. Write: Force a stop interrupt.
#define SI32_I2C_A_CONTROL_STOI_SET_VALUE  1
#define SI32_I2C_A_CONTROL_STOI_SET_U32 \
   (SI32_I2C_A_CONTROL_STOI_SET_VALUE << SI32_I2C_A_CONTROL_STOI_SHIFT)

#define SI32_I2C_A_CONTROL_ACKI_MASK  0x00000200
#define SI32_I2C_A_CONTROL_ACKI_SHIFT  9
// Read: An acknowledge interrupt has not occurred. Write: Clear the acknowledge
// interrupt (ACKI).
#define SI32_I2C_A_CONTROL_ACKI_NOT_SET_VALUE  0
#define SI32_I2C_A_CONTROL_ACKI_NOT_SET_U32 \
   (SI32_I2C_A_CONTROL_ACKI_NOT_SET_VALUE << SI32_I2C_A_CONTROL_ACKI_SHIFT)
// Read: An acknowledge interrupt occurred. Write: Force an acknowledge interrupt.
#define SI32_I2C_A_CONTROL_ACKI_SET_VALUE  1
#define SI32_I2C_A_CONTROL_ACKI_SET_U32 \
   (SI32_I2C_A_CONTROL_ACKI_SET_VALUE << SI32_I2C_A_CONTROL_ACKI_SHIFT)

#define SI32_I2C_A_CONTROL_RXI_MASK  0x00000400
#define SI32_I2C_A_CONTROL_RXI_SHIFT  10
// Read: A receive done interrupt has not occurred. Write: Clear the receive done
// interrupt (RXI).
#define SI32_I2C_A_CONTROL_RXI_NOT_SET_VALUE  0
#define SI32_I2C_A_CONTROL_RXI_NOT_SET_U32 \
   (SI32_I2C_A_CONTROL_RXI_NOT_SET_VALUE << SI32_I2C_A_CONTROL_RXI_SHIFT)
// Read: Receive done interrupt occurred. Write: Force a receive done interrupt.
#define SI32_I2C_A_CONTROL_RXI_SET_VALUE  1
#define SI32_I2C_A_CONTROL_RXI_SET_U32 \
   (SI32_I2C_A_CONTROL_RXI_SET_VALUE << SI32_I2C_A_CONTROL_RXI_SHIFT)

#define SI32_I2C_A_CONTROL_TXI_MASK  0x00000800
#define SI32_I2C_A_CONTROL_TXI_SHIFT  11
// Read: A transmit done interrupt has not occurred. Write: Clear the transmit done
// interrupt (TXI).
#define SI32_I2C_A_CONTROL_TXI_NOT_SET_VALUE  0
#define SI32_I2C_A_CONTROL_TXI_NOT_SET_U32 \
   (SI32_I2C_A_CONTROL_TXI_NOT_SET_VALUE << SI32_I2C_A_CONTROL_TXI_SHIFT)
// Read: Transmit done interrupt detected. If the transmit is forced to abort by a
// NACK response, the acknowledge interrupt (ACKI) will also be set. Write: Force a
// transmit done interrupt.
#define SI32_I2C_A_CONTROL_TXI_SET_VALUE  1
#define SI32_I2C_A_CONTROL_TXI_SET_U32 \
   (SI32_I2C_A_CONTROL_TXI_SET_VALUE << SI32_I2C_A_CONTROL_TXI_SHIFT)

#define SI32_I2C_A_CONTROL_STAI_MASK  0x00001000
#define SI32_I2C_A_CONTROL_STAI_SHIFT  12
// Read: Start interrupt has not occurred. Write: Clear the start interrupt (STAI).
#define SI32_I2C_A_CONTROL_STAI_NOT_SET_VALUE  0
#define SI32_I2C_A_CONTROL_STAI_NOT_SET_U32 \
   (SI32_I2C_A_CONTROL_STAI_NOT_SET_VALUE << SI32_I2C_A_CONTROL_STAI_SHIFT)
// Read: Start or repeat start interrupt occurred.  In Slave mode, a start or
// repeat start is detected.  In Master mode, a start or repeat start has been
// generated.
#define SI32_I2C_A_CONTROL_STAI_SET_VALUE  1
#define SI32_I2C_A_CONTROL_STAI_SET_U32 \
   (SI32_I2C_A_CONTROL_STAI_SET_VALUE << SI32_I2C_A_CONTROL_STAI_SHIFT)

#define SI32_I2C_A_CONTROL_ARBLI_MASK  0x00002000
#define SI32_I2C_A_CONTROL_ARBLI_SHIFT  13
// Read: An arbitration lost interrupt has not occurred. Write: Clear the
// arbitration lost interrupt (ARBLI).
#define SI32_I2C_A_CONTROL_ARBLI_NOT_SET_VALUE  0
#define SI32_I2C_A_CONTROL_ARBLI_NOT_SET_U32 \
   (SI32_I2C_A_CONTROL_ARBLI_NOT_SET_VALUE << SI32_I2C_A_CONTROL_ARBLI_SHIFT)
// Read: Arbitration lost interrupt detected. Write: Force an arbitration lost
// interrupt.
#define SI32_I2C_A_CONTROL_ARBLI_SET_VALUE  1
#define SI32_I2C_A_CONTROL_ARBLI_SET_U32 \
   (SI32_I2C_A_CONTROL_ARBLI_SET_VALUE << SI32_I2C_A_CONTROL_ARBLI_SHIFT)

#define SI32_I2C_A_CONTROL_T0I_MASK  0x00004000
#define SI32_I2C_A_CONTROL_T0I_SHIFT  14
// Read: A I2C Timer Byte 0 interrupt has not occurred. Write: Clear the I2C Timer
// Byte 0 interrupt (T0I).
#define SI32_I2C_A_CONTROL_T0I_NOT_SET_VALUE  0
#define SI32_I2C_A_CONTROL_T0I_NOT_SET_U32 \
   (SI32_I2C_A_CONTROL_T0I_NOT_SET_VALUE << SI32_I2C_A_CONTROL_T0I_SHIFT)
// Read: I2C Timer Byte 0 overflow interrupt detected. Write: Force a I2C Timer
// Byte 0 interrupt.
#define SI32_I2C_A_CONTROL_T0I_SET_VALUE  1
#define SI32_I2C_A_CONTROL_T0I_SET_U32 \
   (SI32_I2C_A_CONTROL_T0I_SET_VALUE << SI32_I2C_A_CONTROL_T0I_SHIFT)

#define SI32_I2C_A_CONTROL_T1I_MASK  0x00008000
#define SI32_I2C_A_CONTROL_T1I_SHIFT  15
// Read: No interrupt occurred. Write: Clear the I2C Timer Byte 1 interrupt (T1I).
#define SI32_I2C_A_CONTROL_T1I_NOT_SET_VALUE  0
#define SI32_I2C_A_CONTROL_T1I_NOT_SET_U32 \
   (SI32_I2C_A_CONTROL_T1I_NOT_SET_VALUE << SI32_I2C_A_CONTROL_T1I_SHIFT)
// Read: I2C Timer Byte 1 overflow interrupt is detected. Write: Force a I2C Timer
// Byte 1 interrupt.
#define SI32_I2C_A_CONTROL_T1I_SET_VALUE  1
#define SI32_I2C_A_CONTROL_T1I_SET_U32 \
   (SI32_I2C_A_CONTROL_T1I_SET_VALUE << SI32_I2C_A_CONTROL_T1I_SHIFT)

#define SI32_I2C_A_CONTROL_T2I_MASK  0x00010000
#define SI32_I2C_A_CONTROL_T2I_SHIFT  16
// Read: A I2C Timer Byte 2 interrupt has not occurred. Write: Clear the I2C Timer
// Byte 2 interrupt (T2I).
#define SI32_I2C_A_CONTROL_T2I_NOT_SET_VALUE  0
#define SI32_I2C_A_CONTROL_T2I_NOT_SET_U32 \
   (SI32_I2C_A_CONTROL_T2I_NOT_SET_VALUE << SI32_I2C_A_CONTROL_T2I_SHIFT)
// Read: I2C Timer Byte 2 overflow interrupt detected. Write: Force a I2C Timer
// Byte 2 interrupt.
#define SI32_I2C_A_CONTROL_T2I_SET_VALUE  1
#define SI32_I2C_A_CONTROL_T2I_SET_U32 \
   (SI32_I2C_A_CONTROL_T2I_SET_VALUE << SI32_I2C_A_CONTROL_T2I_SHIFT)

#define SI32_I2C_A_CONTROL_T3I_MASK  0x00020000
#define SI32_I2C_A_CONTROL_T3I_SHIFT  17
// Read: A I2C Timer Byte 3 interrupt or SCL low timeout has not occurred. Write:
// Clear the I2C Timer Byte 3 interrupt (T3I).
#define SI32_I2C_A_CONTROL_T3I_NOT_SET_VALUE  0
#define SI32_I2C_A_CONTROL_T3I_NOT_SET_U32 \
   (SI32_I2C_A_CONTROL_T3I_NOT_SET_VALUE << SI32_I2C_A_CONTROL_T3I_SHIFT)
// Read: I2C Timer Byte 3 overflow or SCL low timeout interrupt detected. Write:
// Force a I2C Timer Byte 3 interrupt.
#define SI32_I2C_A_CONTROL_T3I_SET_VALUE  1
#define SI32_I2C_A_CONTROL_T3I_SET_U32 \
   (SI32_I2C_A_CONTROL_T3I_SET_VALUE << SI32_I2C_A_CONTROL_T3I_SHIFT)

