jsnyder/FreakUSB/hw/sim3u1xx/si32Hal/SI32_Modules/SI32_I2C_A_Registers.h
#define SI32_I2C_A_CONTROL_RXARM_MASK  0x00040000
#define SI32_I2C_A_CONTROL_RXARM_SHIFT  18
// Disable data and address reception.
#define SI32_I2C_A_CONTROL_RXARM_DISABLED_VALUE  0
#define SI32_I2C_A_CONTROL_RXARM_DISABLED_U32 \
   (SI32_I2C_A_CONTROL_RXARM_DISABLED_VALUE << SI32_I2C_A_CONTROL_RXARM_SHIFT)
// Enable the module to perform a receive operation.
#define SI32_I2C_A_CONTROL_RXARM_ENABLED_VALUE  1
#define SI32_I2C_A_CONTROL_RXARM_ENABLED_U32 \
   (SI32_I2C_A_CONTROL_RXARM_ENABLED_VALUE << SI32_I2C_A_CONTROL_RXARM_SHIFT)

#define SI32_I2C_A_CONTROL_TXARM_MASK  0x00080000
#define SI32_I2C_A_CONTROL_TXARM_SHIFT  19
// Disable data and address transmission.
#define SI32_I2C_A_CONTROL_TXARM_DISABLED_VALUE  0
#define SI32_I2C_A_CONTROL_TXARM_DISABLED_U32 \
   (SI32_I2C_A_CONTROL_TXARM_DISABLED_VALUE << SI32_I2C_A_CONTROL_TXARM_SHIFT)
// Enable the module to perform a transmit operation.
#define SI32_I2C_A_CONTROL_TXARM_ENABLED_VALUE  1
#define SI32_I2C_A_CONTROL_TXARM_ENABLED_U32 \
   (SI32_I2C_A_CONTROL_TXARM_ENABLED_VALUE << SI32_I2C_A_CONTROL_TXARM_SHIFT)

#define SI32_I2C_A_CONTROL_SLVAF_MASK  0x00100000
#define SI32_I2C_A_CONTROL_SLVAF_SHIFT  20
// Slave address detected.
#define SI32_I2C_A_CONTROL_SLVAF_SLAVE_ADDRESS_VALUE  0
#define SI32_I2C_A_CONTROL_SLVAF_SLAVE_ADDRESS_U32 \
   (SI32_I2C_A_CONTROL_SLVAF_SLAVE_ADDRESS_VALUE << SI32_I2C_A_CONTROL_SLVAF_SHIFT)
// General Call address detected.
#define SI32_I2C_A_CONTROL_SLVAF_GENERAL_CALL_VALUE  1
#define SI32_I2C_A_CONTROL_SLVAF_GENERAL_CALL_U32 \
   (SI32_I2C_A_CONTROL_SLVAF_GENERAL_CALL_VALUE << SI32_I2C_A_CONTROL_SLVAF_SHIFT)

#define SI32_I2C_A_CONTROL_ATXRXEN_MASK  0x00200000
#define SI32_I2C_A_CONTROL_ATXRXEN_SHIFT  21
// Do not automatically switch to transmit or receive mode after a Start.
#define SI32_I2C_A_CONTROL_ATXRXEN_DISABLED_VALUE  0
#define SI32_I2C_A_CONTROL_ATXRXEN_DISABLED_U32 \
   (SI32_I2C_A_CONTROL_ATXRXEN_DISABLED_VALUE << SI32_I2C_A_CONTROL_ATXRXEN_SHIFT)
// If automatic hardware acknowledge mode is enabled (HACKEN = 1), automatically
// switch to transmit or receive mode after a Start.
#define SI32_I2C_A_CONTROL_ATXRXEN_ENABLED_VALUE  1
#define SI32_I2C_A_CONTROL_ATXRXEN_ENABLED_U32 \
   (SI32_I2C_A_CONTROL_ATXRXEN_ENABLED_VALUE << SI32_I2C_A_CONTROL_ATXRXEN_SHIFT)

#define SI32_I2C_A_CONTROL_FMD_MASK  0x00400000
#define SI32_I2C_A_CONTROL_FMD_SHIFT  22
// Disable the input filter.
#define SI32_I2C_A_CONTROL_FMD_DISABLED_VALUE  0
#define SI32_I2C_A_CONTROL_FMD_DISABLED_U32 \
   (SI32_I2C_A_CONTROL_FMD_DISABLED_VALUE << SI32_I2C_A_CONTROL_FMD_SHIFT)
// Enable the input filter.
#define SI32_I2C_A_CONTROL_FMD_ENABLED_VALUE  1
#define SI32_I2C_A_CONTROL_FMD_ENABLED_U32 \
   (SI32_I2C_A_CONTROL_FMD_ENABLED_VALUE << SI32_I2C_A_CONTROL_FMD_SHIFT)

#define SI32_I2C_A_CONTROL_DBGMD_MASK  0x00800000
#define SI32_I2C_A_CONTROL_DBGMD_SHIFT  23
// The I2C module will continue to operate while the core is halted in debug mode.
#define SI32_I2C_A_CONTROL_DBGMD_RUN_VALUE  0
#define SI32_I2C_A_CONTROL_DBGMD_RUN_U32 \
   (SI32_I2C_A_CONTROL_DBGMD_RUN_VALUE << SI32_I2C_A_CONTROL_DBGMD_SHIFT)
// A debug breakpoint will cause the I2C module to halt.
#define SI32_I2C_A_CONTROL_DBGMD_HALT_VALUE  1
#define SI32_I2C_A_CONTROL_DBGMD_HALT_U32 \
   (SI32_I2C_A_CONTROL_DBGMD_HALT_VALUE << SI32_I2C_A_CONTROL_DBGMD_SHIFT)

#define SI32_I2C_A_CONTROL_SMINH_MASK  0x01000000
#define SI32_I2C_A_CONTROL_SMINH_SHIFT  24
// Enable Slave modes.
#define SI32_I2C_A_CONTROL_SMINH_INACTIVE_VALUE  0
#define SI32_I2C_A_CONTROL_SMINH_INACTIVE_U32 \
   (SI32_I2C_A_CONTROL_SMINH_INACTIVE_VALUE << SI32_I2C_A_CONTROL_SMINH_SHIFT)
// Inhibit Slave modes. The module will not respond to a Master on the bus.
#define SI32_I2C_A_CONTROL_SMINH_ACTIVE_VALUE  1
#define SI32_I2C_A_CONTROL_SMINH_ACTIVE_U32 \
   (SI32_I2C_A_CONTROL_SMINH_ACTIVE_VALUE << SI32_I2C_A_CONTROL_SMINH_SHIFT)

#define SI32_I2C_A_CONTROL_HACKEN_MASK  0x02000000
#define SI32_I2C_A_CONTROL_HACKEN_SHIFT  25
// Disable automatic hardware acknowledge.
#define SI32_I2C_A_CONTROL_HACKEN_DISABLED_VALUE  0
#define SI32_I2C_A_CONTROL_HACKEN_DISABLED_U32 \
   (SI32_I2C_A_CONTROL_HACKEN_DISABLED_VALUE << SI32_I2C_A_CONTROL_HACKEN_SHIFT)
// Enable automatic hardware acknowledge.
#define SI32_I2C_A_CONTROL_HACKEN_ENABLED_VALUE  1
#define SI32_I2C_A_CONTROL_HACKEN_ENABLED_U32 \
   (SI32_I2C_A_CONTROL_HACKEN_ENABLED_VALUE << SI32_I2C_A_CONTROL_HACKEN_SHIFT)

#define SI32_I2C_A_CONTROL_LBACKEN_MASK  0x08000000
#define SI32_I2C_A_CONTROL_LBACKEN_SHIFT  27
// NACK after the last byte is received.
#define SI32_I2C_A_CONTROL_LBACKEN_DISABLED_VALUE  0
#define SI32_I2C_A_CONTROL_LBACKEN_DISABLED_U32 \
   (SI32_I2C_A_CONTROL_LBACKEN_DISABLED_VALUE << SI32_I2C_A_CONTROL_LBACKEN_SHIFT)
// ACK after the last byte is received.
#define SI32_I2C_A_CONTROL_LBACKEN_ENABLED_VALUE  1
#define SI32_I2C_A_CONTROL_LBACKEN_ENABLED_U32 \
   (SI32_I2C_A_CONTROL_LBACKEN_ENABLED_VALUE << SI32_I2C_A_CONTROL_LBACKEN_SHIFT)

#define SI32_I2C_A_CONTROL_GCEN_MASK  0x20000000
#define SI32_I2C_A_CONTROL_GCEN_SHIFT  29
// Disable General Call address decoding.
#define SI32_I2C_A_CONTROL_GCEN_DISABLED_VALUE  0
#define SI32_I2C_A_CONTROL_GCEN_DISABLED_U32 \
   (SI32_I2C_A_CONTROL_GCEN_DISABLED_VALUE << SI32_I2C_A_CONTROL_GCEN_SHIFT)
// Enable General Call address decoding.
#define SI32_I2C_A_CONTROL_GCEN_ENABLED_VALUE  1
#define SI32_I2C_A_CONTROL_GCEN_ENABLED_U32 \
   (SI32_I2C_A_CONTROL_GCEN_ENABLED_VALUE << SI32_I2C_A_CONTROL_GCEN_SHIFT)

#define SI32_I2C_A_CONTROL_RESET_MASK  0x40000000
#define SI32_I2C_A_CONTROL_RESET_SHIFT  30
// I2C module is not in soft reset.
#define SI32_I2C_A_CONTROL_RESET_INACTIVE_VALUE  0
#define SI32_I2C_A_CONTROL_RESET_INACTIVE_U32 \
   (SI32_I2C_A_CONTROL_RESET_INACTIVE_VALUE << SI32_I2C_A_CONTROL_RESET_SHIFT)
// I2C module is in soft reset and firmware cannot access all bits in the module.
#define SI32_I2C_A_CONTROL_RESET_ACTIVE_VALUE  1
#define SI32_I2C_A_CONTROL_RESET_ACTIVE_U32 \
   (SI32_I2C_A_CONTROL_RESET_ACTIVE_VALUE << SI32_I2C_A_CONTROL_RESET_SHIFT)

#define SI32_I2C_A_CONTROL_I2CEN_MASK  0x80000000
#define SI32_I2C_A_CONTROL_I2CEN_SHIFT  31
// Disable the I2C module.
#define SI32_I2C_A_CONTROL_I2CEN_DISABLED_VALUE  0U
#define SI32_I2C_A_CONTROL_I2CEN_DISABLED_U32 \
   (SI32_I2C_A_CONTROL_I2CEN_DISABLED_VALUE << SI32_I2C_A_CONTROL_I2CEN_SHIFT)
// Enable the I2C module.
#define SI32_I2C_A_CONTROL_I2CEN_ENABLED_VALUE  1U
#define SI32_I2C_A_CONTROL_I2CEN_ENABLED_U32 \
   (SI32_I2C_A_CONTROL_I2CEN_ENABLED_VALUE << SI32_I2C_A_CONTROL_I2CEN_SHIFT)



struct SI32_I2C_A_CONFIG_Struct
{
   union
   {
      struct
      {
         // I2C Clock Scaler
         volatile uint32_t SCALER: 6;
                  uint32_t reserved0: 2;
         // Stop Interrupt Enable
         volatile uint32_t STOIEN: 1;
         // Acknowledge Interrupt Enable
         volatile uint32_t ACKIEN: 1;
         // Receive Done Interrupt Enable
         volatile uint32_t RXIEN: 1;
         // Transmit Done Interrupt Enable
         volatile uint32_t TXIEN: 1;
         // Start Interrupt Enable
         volatile uint32_t STAIEN: 1;
         // Arbitration Lost Interrupt Enable
         volatile uint32_t ARBLIEN: 1;
         // I2C Timer Byte 0 Interrupt Enable
         volatile uint32_t T0IEN: 1;
         // I2C Timer Byte 1 Interrupt Enable
         volatile uint32_t T1IEN: 1;
         // I2C Timer Byte 2 Interrupt Enable
         volatile uint32_t T2IEN: 1;
         // I2C Timer Byte 3 Interrupt Enable
         volatile uint32_t T3IEN: 1;
                  uint32_t reserved1: 2;
         // Transfer Byte Count
         volatile uint32_t BC: 2;
         // Transfer Byte Pointer
         volatile uint32_t BP: 2;
         // I2C Timer Byte 0 Run
         volatile uint32_t T0RUN: 1;
         // I2C Timer Byte 1 Run
         volatile uint32_t T1RUN: 1;
         // I2C Timer Byte 2 Run
         volatile uint32_t T2RUN: 1;
         // I2C Timer Byte 3 Run
         volatile uint32_t T3RUN: 1;
         // I2C Timer Mode
         volatile uint32_t TMD: 2;
                  uint32_t reserved2: 1;
         // I2C Timer Enable
         volatile uint32_t TIMEREN: 1;
      };
      volatile uint32_t U32;
   };
};

#define SI32_I2C_A_CONFIG_SCALER_MASK  0x0000003F
#define SI32_I2C_A_CONFIG_SCALER_SHIFT  0

#define SI32_I2C_A_CONFIG_STOIEN_MASK  0x00000100
#define SI32_I2C_A_CONFIG_STOIEN_SHIFT  8
// Disable the stop interrupt.
#define SI32_I2C_A_CONFIG_STOIEN_DISABLED_VALUE  0
#define SI32_I2C_A_CONFIG_STOIEN_DISABLED_U32 \
   (SI32_I2C_A_CONFIG_STOIEN_DISABLED_VALUE << SI32_I2C_A_CONFIG_STOIEN_SHIFT)
// Enable the stop interrupt (STOI).
#define SI32_I2C_A_CONFIG_STOIEN_ENABLED_VALUE  1
#define SI32_I2C_A_CONFIG_STOIEN_ENABLED_U32 \
   (SI32_I2C_A_CONFIG_STOIEN_ENABLED_VALUE << SI32_I2C_A_CONFIG_STOIEN_SHIFT)

