jsnyder/FreakUSB/hw/sim3u1xx/si32Hal/SI32_Modules/SI32_I2C_A_Registers.h
#define SI32_I2C_A_CONFIG_ACKIEN_MASK  0x00000200
#define SI32_I2C_A_CONFIG_ACKIEN_SHIFT  9
// Disable the acknowledge interrupt.
#define SI32_I2C_A_CONFIG_ACKIEN_DISABLED_VALUE  0
#define SI32_I2C_A_CONFIG_ACKIEN_DISABLED_U32 \
   (SI32_I2C_A_CONFIG_ACKIEN_DISABLED_VALUE << SI32_I2C_A_CONFIG_ACKIEN_SHIFT)
// Enable the acknowledge interrupt (ACKI).
#define SI32_I2C_A_CONFIG_ACKIEN_ENABLED_VALUE  1
#define SI32_I2C_A_CONFIG_ACKIEN_ENABLED_U32 \
   (SI32_I2C_A_CONFIG_ACKIEN_ENABLED_VALUE << SI32_I2C_A_CONFIG_ACKIEN_SHIFT)

#define SI32_I2C_A_CONFIG_RXIEN_MASK  0x00000400
#define SI32_I2C_A_CONFIG_RXIEN_SHIFT  10
// Disable the receive done interrupt.
#define SI32_I2C_A_CONFIG_RXIEN_DISABLED_VALUE  0
#define SI32_I2C_A_CONFIG_RXIEN_DISABLED_U32 \
   (SI32_I2C_A_CONFIG_RXIEN_DISABLED_VALUE << SI32_I2C_A_CONFIG_RXIEN_SHIFT)
// Enable the receive done interrupt (RXI).
#define SI32_I2C_A_CONFIG_RXIEN_ENABLED_VALUE  1
#define SI32_I2C_A_CONFIG_RXIEN_ENABLED_U32 \
   (SI32_I2C_A_CONFIG_RXIEN_ENABLED_VALUE << SI32_I2C_A_CONFIG_RXIEN_SHIFT)

#define SI32_I2C_A_CONFIG_TXIEN_MASK  0x00000800
#define SI32_I2C_A_CONFIG_TXIEN_SHIFT  11
// Disable the transmit done interrupt.
#define SI32_I2C_A_CONFIG_TXIEN_DISABLED_VALUE  0
#define SI32_I2C_A_CONFIG_TXIEN_DISABLED_U32 \
   (SI32_I2C_A_CONFIG_TXIEN_DISABLED_VALUE << SI32_I2C_A_CONFIG_TXIEN_SHIFT)
// Enable the transmit done interrupt (TXI).
#define SI32_I2C_A_CONFIG_TXIEN_ENABLED_VALUE  1
#define SI32_I2C_A_CONFIG_TXIEN_ENABLED_U32 \
   (SI32_I2C_A_CONFIG_TXIEN_ENABLED_VALUE << SI32_I2C_A_CONFIG_TXIEN_SHIFT)

#define SI32_I2C_A_CONFIG_STAIEN_MASK  0x00001000
#define SI32_I2C_A_CONFIG_STAIEN_SHIFT  12
// Disable the start interrupt.
#define SI32_I2C_A_CONFIG_STAIEN_DISABLED_VALUE  0
#define SI32_I2C_A_CONFIG_STAIEN_DISABLED_U32 \
   (SI32_I2C_A_CONFIG_STAIEN_DISABLED_VALUE << SI32_I2C_A_CONFIG_STAIEN_SHIFT)
// Enable the start interrupt (STAI).
#define SI32_I2C_A_CONFIG_STAIEN_ENABLED_VALUE  1
#define SI32_I2C_A_CONFIG_STAIEN_ENABLED_U32 \
   (SI32_I2C_A_CONFIG_STAIEN_ENABLED_VALUE << SI32_I2C_A_CONFIG_STAIEN_SHIFT)

#define SI32_I2C_A_CONFIG_ARBLIEN_MASK  0x00002000
#define SI32_I2C_A_CONFIG_ARBLIEN_SHIFT  13
// Disable the arbitration lost interrupt.
#define SI32_I2C_A_CONFIG_ARBLIEN_DISABLED_VALUE  0
#define SI32_I2C_A_CONFIG_ARBLIEN_DISABLED_U32 \
   (SI32_I2C_A_CONFIG_ARBLIEN_DISABLED_VALUE << SI32_I2C_A_CONFIG_ARBLIEN_SHIFT)
// Enable the arbitration lost interrupt (ARBLI).
#define SI32_I2C_A_CONFIG_ARBLIEN_ENABLED_VALUE  1
#define SI32_I2C_A_CONFIG_ARBLIEN_ENABLED_U32 \
   (SI32_I2C_A_CONFIG_ARBLIEN_ENABLED_VALUE << SI32_I2C_A_CONFIG_ARBLIEN_SHIFT)

#define SI32_I2C_A_CONFIG_T0IEN_MASK  0x00004000
#define SI32_I2C_A_CONFIG_T0IEN_SHIFT  14
// Disable the I2C Timer Byte 0 interrupt.
#define SI32_I2C_A_CONFIG_T0IEN_DISABLED_VALUE  0
#define SI32_I2C_A_CONFIG_T0IEN_DISABLED_U32 \
   (SI32_I2C_A_CONFIG_T0IEN_DISABLED_VALUE << SI32_I2C_A_CONFIG_T0IEN_SHIFT)
// Enable the I2C Timer Byte 0 interrupt (T0I).
#define SI32_I2C_A_CONFIG_T0IEN_ENABLED_VALUE  1
#define SI32_I2C_A_CONFIG_T0IEN_ENABLED_U32 \
   (SI32_I2C_A_CONFIG_T0IEN_ENABLED_VALUE << SI32_I2C_A_CONFIG_T0IEN_SHIFT)

#define SI32_I2C_A_CONFIG_T1IEN_MASK  0x00008000
#define SI32_I2C_A_CONFIG_T1IEN_SHIFT  15
// Disable the I2C Timer Byte 1 interrupt.
#define SI32_I2C_A_CONFIG_T1IEN_DISABLED_VALUE  0
#define SI32_I2C_A_CONFIG_T1IEN_DISABLED_U32 \
   (SI32_I2C_A_CONFIG_T1IEN_DISABLED_VALUE << SI32_I2C_A_CONFIG_T1IEN_SHIFT)
// Enable the I2C Timer Byte 1 interrupt (T1I).
#define SI32_I2C_A_CONFIG_T1IEN_ENABLED_VALUE  1
#define SI32_I2C_A_CONFIG_T1IEN_ENABLED_U32 \
   (SI32_I2C_A_CONFIG_T1IEN_ENABLED_VALUE << SI32_I2C_A_CONFIG_T1IEN_SHIFT)

#define SI32_I2C_A_CONFIG_T2IEN_MASK  0x00010000
#define SI32_I2C_A_CONFIG_T2IEN_SHIFT  16
// Disable the I2C Timer Byte 2 interrupt.
#define SI32_I2C_A_CONFIG_T2IEN_DISABLED_VALUE  0
#define SI32_I2C_A_CONFIG_T2IEN_DISABLED_U32 \
   (SI32_I2C_A_CONFIG_T2IEN_DISABLED_VALUE << SI32_I2C_A_CONFIG_T2IEN_SHIFT)
// Enable the I2C Timer Byte 2 interrupt (T2I).
#define SI32_I2C_A_CONFIG_T2IEN_ENABLED_VALUE  1
#define SI32_I2C_A_CONFIG_T2IEN_ENABLED_U32 \
   (SI32_I2C_A_CONFIG_T2IEN_ENABLED_VALUE << SI32_I2C_A_CONFIG_T2IEN_SHIFT)

#define SI32_I2C_A_CONFIG_T3IEN_MASK  0x00020000
#define SI32_I2C_A_CONFIG_T3IEN_SHIFT  17
// Disable the I2C Timer Byte 3 and SCL low timeout interrupt.
#define SI32_I2C_A_CONFIG_T3IEN_DISABLED_VALUE  0
#define SI32_I2C_A_CONFIG_T3IEN_DISABLED_U32 \
   (SI32_I2C_A_CONFIG_T3IEN_DISABLED_VALUE << SI32_I2C_A_CONFIG_T3IEN_SHIFT)
// Enable the I2C Timer Byte 3 and SCL low timeout interrupt (T3I).
#define SI32_I2C_A_CONFIG_T3IEN_ENABLED_VALUE  1
#define SI32_I2C_A_CONFIG_T3IEN_ENABLED_U32 \
   (SI32_I2C_A_CONFIG_T3IEN_ENABLED_VALUE << SI32_I2C_A_CONFIG_T3IEN_SHIFT)

#define SI32_I2C_A_CONFIG_BC_MASK  0x00300000
#define SI32_I2C_A_CONFIG_BC_SHIFT  20

#define SI32_I2C_A_CONFIG_BP_MASK  0x00C00000
#define SI32_I2C_A_CONFIG_BP_SHIFT  22

#define SI32_I2C_A_CONFIG_T0RUN_MASK  0x01000000
#define SI32_I2C_A_CONFIG_T0RUN_SHIFT  24
// Stop Timer Byte 0.
#define SI32_I2C_A_CONFIG_T0RUN_STOP_VALUE  0
#define SI32_I2C_A_CONFIG_T0RUN_STOP_U32 \
   (SI32_I2C_A_CONFIG_T0RUN_STOP_VALUE << SI32_I2C_A_CONFIG_T0RUN_SHIFT)
// Start Timer Byte 0 running.
#define SI32_I2C_A_CONFIG_T0RUN_START_VALUE  1
#define SI32_I2C_A_CONFIG_T0RUN_START_U32 \
   (SI32_I2C_A_CONFIG_T0RUN_START_VALUE << SI32_I2C_A_CONFIG_T0RUN_SHIFT)

#define SI32_I2C_A_CONFIG_T1RUN_MASK  0x02000000
#define SI32_I2C_A_CONFIG_T1RUN_SHIFT  25
// Stop Timer Byte 1.
#define SI32_I2C_A_CONFIG_T1RUN_STOP_VALUE  0
#define SI32_I2C_A_CONFIG_T1RUN_STOP_U32 \
   (SI32_I2C_A_CONFIG_T1RUN_STOP_VALUE << SI32_I2C_A_CONFIG_T1RUN_SHIFT)
// Start Timer Byte 1 running.
#define SI32_I2C_A_CONFIG_T1RUN_START_VALUE  1
#define SI32_I2C_A_CONFIG_T1RUN_START_U32 \
   (SI32_I2C_A_CONFIG_T1RUN_START_VALUE << SI32_I2C_A_CONFIG_T1RUN_SHIFT)

#define SI32_I2C_A_CONFIG_T2RUN_MASK  0x04000000
#define SI32_I2C_A_CONFIG_T2RUN_SHIFT  26
// Stop Timer Byte 2.
#define SI32_I2C_A_CONFIG_T2RUN_STOP_VALUE  0
#define SI32_I2C_A_CONFIG_T2RUN_STOP_U32 \
   (SI32_I2C_A_CONFIG_T2RUN_STOP_VALUE << SI32_I2C_A_CONFIG_T2RUN_SHIFT)
// Start Timer Byte 2 running.
#define SI32_I2C_A_CONFIG_T2RUN_START_VALUE  1
#define SI32_I2C_A_CONFIG_T2RUN_START_U32 \
   (SI32_I2C_A_CONFIG_T2RUN_START_VALUE << SI32_I2C_A_CONFIG_T2RUN_SHIFT)

