jsnyder/FreakUSB/hw/sim3u1xx/si32Hal/SI32_Modules/SI32_I2C_A_Registers.h
#define SI32_I2C_A_CONFIG_T3RUN_MASK  0x08000000
#define SI32_I2C_A_CONFIG_T3RUN_SHIFT  27
// Stop Timer Byte 3.
#define SI32_I2C_A_CONFIG_T3RUN_STOP_VALUE  0
#define SI32_I2C_A_CONFIG_T3RUN_STOP_U32 \
   (SI32_I2C_A_CONFIG_T3RUN_STOP_VALUE << SI32_I2C_A_CONFIG_T3RUN_SHIFT)
// Start Timer Byte 3 running.
#define SI32_I2C_A_CONFIG_T3RUN_START_VALUE  1
#define SI32_I2C_A_CONFIG_T3RUN_START_U32 \
   (SI32_I2C_A_CONFIG_T3RUN_START_VALUE << SI32_I2C_A_CONFIG_T3RUN_SHIFT)

#define SI32_I2C_A_CONFIG_TMD_MASK  0x30000000
#define SI32_I2C_A_CONFIG_TMD_SHIFT  28
// I2C Timer Mode 0: Operate the I2C timer as a single 32-bit timer : Timer Bytes
// [3 : 2 : 1 : 0].
#define SI32_I2C_A_CONFIG_TMD_MODE0_VALUE  0
#define SI32_I2C_A_CONFIG_TMD_MODE0_U32 \
   (SI32_I2C_A_CONFIG_TMD_MODE0_VALUE << SI32_I2C_A_CONFIG_TMD_SHIFT)
// I2C Timer Mode 1: Operate the I2C timer as two 16-bit timers : Timer Bytes [3 :
// 2] and Timer Bytes [1 : 0].
#define SI32_I2C_A_CONFIG_TMD_MODE1_VALUE  1
#define SI32_I2C_A_CONFIG_TMD_MODE1_U32 \
   (SI32_I2C_A_CONFIG_TMD_MODE1_VALUE << SI32_I2C_A_CONFIG_TMD_SHIFT)
// I2C Timer Mode 2: Operate the I2C timer as four independent 8-bit timers :
// Timer Byte 3, Timer Byte 2, Timer Byte 1, and Timer Byte 0.
#define SI32_I2C_A_CONFIG_TMD_MODE2_VALUE  2
#define SI32_I2C_A_CONFIG_TMD_MODE2_U32 \
   (SI32_I2C_A_CONFIG_TMD_MODE2_VALUE << SI32_I2C_A_CONFIG_TMD_SHIFT)
// I2C Timer Mode 3: Operate the I2C timer as one 16-bit and two 8-bit timers :
// Timer Bytes [3 : 2], Timer Byte 1, and Timer Byte 0.
#define SI32_I2C_A_CONFIG_TMD_MODE3_VALUE  3
#define SI32_I2C_A_CONFIG_TMD_MODE3_U32 \
   (SI32_I2C_A_CONFIG_TMD_MODE3_VALUE << SI32_I2C_A_CONFIG_TMD_SHIFT)

#define SI32_I2C_A_CONFIG_TIMEREN_MASK  0x80000000
#define SI32_I2C_A_CONFIG_TIMEREN_SHIFT  31
// Disable I2C Timer.
#define SI32_I2C_A_CONFIG_TIMEREN_DISABLED_VALUE  0U
#define SI32_I2C_A_CONFIG_TIMEREN_DISABLED_U32 \
   (SI32_I2C_A_CONFIG_TIMEREN_DISABLED_VALUE << SI32_I2C_A_CONFIG_TIMEREN_SHIFT)
// Enable I2C Timer for general purpose use. This setting should not be used when
// the I2C module is enabled (I2CEN = 1).
#define SI32_I2C_A_CONFIG_TIMEREN_ENABLED_VALUE  1U
#define SI32_I2C_A_CONFIG_TIMEREN_ENABLED_U32 \
   (SI32_I2C_A_CONFIG_TIMEREN_ENABLED_VALUE << SI32_I2C_A_CONFIG_TIMEREN_SHIFT)



struct SI32_I2C_A_SADDRESS_Struct
{
   union
   {
      struct
      {
                  uint32_t reserved0: 1;
         // Slave Address
         volatile uint32_t ADDRESS: 7;
                  uint32_t reserved1: 24;
      };
      volatile uint32_t U32;
   };
};

#define SI32_I2C_A_SADDRESS_ADDRESS_MASK  0x000000FE
#define SI32_I2C_A_SADDRESS_ADDRESS_SHIFT  1



struct SI32_I2C_A_SMASK_Struct
{
   union
   {
      struct
      {
                  uint32_t reserved0: 1;
         // Slave Address Mask
         volatile uint32_t MASK: 7;
                  uint32_t reserved1: 24;
      };
      volatile uint32_t U32;
   };
};

#define SI32_I2C_A_SMASK_MASK_MASK  0x000000FE
#define SI32_I2C_A_SMASK_MASK_SHIFT  1



struct SI32_I2C_A_DATA_Struct
{
   union
   {
      struct
      {
         // Data
         volatile uint32_t DATA_BITS;
      };
      volatile uint32_t U32;
   };
};

#define SI32_I2C_A_DATA_DATA_MASK  0xFFFFFFFF
#define SI32_I2C_A_DATA_DATA_SHIFT  0



struct SI32_I2C_A_TIMER_Struct
{
   union
   {
      struct
      {
         // Timer Byte 0
         volatile uint8_t T0;
         // Timer Byte 1
         volatile uint8_t T1;
         // Timer Byte 2
         volatile uint8_t T2;
         // Timer Byte 3
         volatile uint8_t T3;
      };
      volatile uint32_t U32;
   };
};

#define SI32_I2C_A_TIMER_T0_MASK  0x000000FF
#define SI32_I2C_A_TIMER_T0_SHIFT  0

#define SI32_I2C_A_TIMER_T1_MASK  0x0000FF00
#define SI32_I2C_A_TIMER_T1_SHIFT  8

#define SI32_I2C_A_TIMER_T2_MASK  0x00FF0000
#define SI32_I2C_A_TIMER_T2_SHIFT  16

#define SI32_I2C_A_TIMER_T3_MASK  0xFF000000
#define SI32_I2C_A_TIMER_T3_SHIFT  24



struct SI32_I2C_A_TIMERRL_Struct
{
   union
   {
      struct
      {
         // Timer Byte 0 Reload Value
         volatile uint8_t T0RL;
         // Timer Byte 1 Reload Value
         volatile uint8_t T1RL;
         // Timer Byte 2 Reload Value
         volatile uint8_t T2RL;
         // Timer Byte 3 Reload Value
         volatile uint8_t T3RL;
      };
      volatile uint32_t U32;
   };
};

#define SI32_I2C_A_TIMERRL_T0RL_MASK  0x000000FF
#define SI32_I2C_A_TIMERRL_T0RL_SHIFT  0

#define SI32_I2C_A_TIMERRL_T1RL_MASK  0x0000FF00
#define SI32_I2C_A_TIMERRL_T1RL_SHIFT  8

#define SI32_I2C_A_TIMERRL_T2RL_MASK  0x00FF0000
#define SI32_I2C_A_TIMERRL_T2RL_SHIFT  16

#define SI32_I2C_A_TIMERRL_T3RL_MASK  0xFF000000
#define SI32_I2C_A_TIMERRL_T3RL_SHIFT  24



struct SI32_I2C_A_SCONFIG_Struct
{
   union
   {
      struct
      {
         // Data Setup Time Extension
         volatile uint32_t SETUP: 4;
         // Data Hold Time Extension
         volatile uint32_t HOLD: 4;
         // SCL Low Time Extension
         volatile uint8_t SCLL;
         // SCL Low Timer Bits [3:0]
         volatile uint32_t SCLLTIMER: 4;
                  uint32_t reserved0: 12;
      };
      volatile uint32_t U32;
   };
};

#define SI32_I2C_A_SCONFIG_SETUP_MASK  0x0000000F
#define SI32_I2C_A_SCONFIG_SETUP_SHIFT  0

#define SI32_I2C_A_SCONFIG_HOLD_MASK  0x000000F0
#define SI32_I2C_A_SCONFIG_HOLD_SHIFT  4

#define SI32_I2C_A_SCONFIG_SCLL_MASK  0x0000FF00
#define SI32_I2C_A_SCONFIG_SCLL_SHIFT  8

#define SI32_I2C_A_SCONFIG_SCLLTIMER_MASK  0x000F0000
#define SI32_I2C_A_SCONFIG_SCLLTIMER_SHIFT  16



struct SI32_I2C_A_I2CDMA_Struct
{
   union
   {
      struct
      {
         // DMA Transfer Length
         volatile uint8_t DMALEN;
                  uint32_t reserved0: 23;
         // DMA Mode Enable
         volatile uint32_t DMAEN: 1;
      };
      volatile uint32_t U32;
   };
};

#define SI32_I2C_A_I2CDMA_DMALEN_MASK  0x000000FF
#define SI32_I2C_A_I2CDMA_DMALEN_SHIFT  0

#define SI32_I2C_A_I2CDMA_DMAEN_MASK  0x80000000
#define SI32_I2C_A_I2CDMA_DMAEN_SHIFT  31
// Disable I2C DMA data requests.
#define SI32_I2C_A_I2CDMA_DMAEN_DISABLED_VALUE  0U
#define SI32_I2C_A_I2CDMA_DMAEN_DISABLED_U32 \
   (SI32_I2C_A_I2CDMA_DMAEN_DISABLED_VALUE << SI32_I2C_A_I2CDMA_DMAEN_SHIFT)
// Enable I2C DMA data requests.
#define SI32_I2C_A_I2CDMA_DMAEN_ENABLED_VALUE  1U
#define SI32_I2C_A_I2CDMA_DMAEN_ENABLED_U32 \
   (SI32_I2C_A_I2CDMA_DMAEN_ENABLED_VALUE << SI32_I2C_A_I2CDMA_DMAEN_SHIFT)



typedef struct SI32_I2C_A_Struct
{
   struct SI32_I2C_A_CONTROL_Struct                CONTROL        ; // Base Address + 0x0
   volatile uint32_t                               CONTROL_SET;
   volatile uint32_t                               CONTROL_CLR;
   uint32_t                                        reserved0;
   struct SI32_I2C_A_CONFIG_Struct                 CONFIG         ; // Base Address + 0x10
   volatile uint32_t                               CONFIG_SET;
   volatile uint32_t                               CONFIG_CLR;
   uint32_t                                        reserved1;
   struct SI32_I2C_A_SADDRESS_Struct               SADDRESS       ; // Base Address + 0x20
   uint32_t                                        reserved2;
   uint32_t                                        reserved3;
   uint32_t                                        reserved4;
   struct SI32_I2C_A_SMASK_Struct                  SMASK          ; // Base Address + 0x30
   uint32_t                                        reserved5;
   uint32_t                                        reserved6;
   uint32_t                                        reserved7;
   struct SI32_I2C_A_DATA_Struct                   DATA           ; // Base Address + 0x40
   uint32_t                                        reserved8;
   uint32_t                                        reserved9;
   uint32_t                                        reserved10;
   struct SI32_I2C_A_TIMER_Struct                  TIMER          ; // Base Address + 0x50
   uint32_t                                        reserved11;
   uint32_t                                        reserved12;
   uint32_t                                        reserved13;
   struct SI32_I2C_A_TIMERRL_Struct                TIMERRL        ; // Base Address + 0x60
   uint32_t                                        reserved14;
   uint32_t                                        reserved15;
   uint32_t                                        reserved16;
   struct SI32_I2C_A_SCONFIG_Struct                SCONFIG        ; // Base Address + 0x70
   uint32_t                                        reserved17;
   uint32_t                                        reserved18;
   uint32_t                                        reserved19;
   struct SI32_I2C_A_I2CDMA_Struct                 I2CDMA         ; // Base Address + 0x80
   uint32_t                                        reserved20;
   uint32_t                                        reserved21;
   uint32_t                                        reserved22;
   uint32_t                                        reserved23[4];
} SI32_I2C_A_Type;

#ifdef __cplusplus
}
#endif

#endif // __SI32_I2C_A_REGISTERS_H__

//-eof--------------------------------------------------------------------------

